from src import app

# TODO
# В конфигах логин и пароль от базы данных удалить и изменить прараметр запуска в src в финальной версии
# подписать везде комментарии и документацию
# автотесты
# добавить иконку везде тоже подобавлять 
# 1 Добавить корректные коды респонсов только в return
# 1 возможно переделать редиректы при ошибке на страницу с ошибкой
# 1 решить все проблемные моменты с редиректами, ретурном страницы с кодом респонса
# возможность загружать картинки
# добавить логгирование если Debug
# переделать concept.jpg и создать ER-диаграмму

# ubuntu
# travis
# docker

# a lot of theory


if __name__ == "__main__":
    app.run()
